In [3]:
import pandas
import numpy

df = pandas.read_csv('house.csv')
df.head(5)

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,313000.0,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02 00:00:00,2384000.0,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,2014-05-02 00:00:00,342000.0,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,2014-05-02 00:00:00,420000.0,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,2014-05-02 00:00:00,550000.0,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA

### Práctica 1
Haz un corte por número de línea, quedándote con las primeras 500 líneas. Llama a este DF 'corte500'

Genera 2 dataframe (llamados sample1, sample2) aleatorio a partir de corte500, con un 55% de los valores, solamente de las columnas price, bedrooms, bathrooms, sqft_living, city.

In [5]:
corte500=df.head(500)

In [7]:
sample=corte500.reindex(columns=['price', 'bedrooms', 'bathrooms', 'sqft_living','city'], copy=True, fill_value=0)
sample1=sample.sample(frac=0.55)
sample1

        price  bedrooms  bathrooms  sqft_living         city
109  220000.0       4.0       1.50         1240  Federal Way
444  851000.0       3.0       2.50         3560      Redmond
210  655500.0       4.0       3.50         3380    Shoreline
90   800866.0       5.0       2.50         3180     Kirkland
467  265000.0       4.0       1.00         1940         Kent
..        ...       ...        ...          ...          ...
430  583000.0       4.0       2.50         2660      Redmond
335  266000.0       3.0       2.50         1940         Kent
23   612500.0       4.0       2.50         2730      Bothell
423  463000.0       2.0       1.00         1150      Seattle
57   785000.0       5.0       3.25         3660   Snoqualmie

[275 rows x 5 columns]

In [8]:
sample2=sample.sample(frac=0.55)
sample2

        price  bedrooms  bathrooms  sqft_living       city
212  533000.0       5.0       2.75         1800    Seattle
304  405000.0       3.0       2.25         1660  Shoreline
311  425000.0       2.0       2.50         1150    Seattle
385  494000.0       3.0       2.50         2310    Kenmore
287  239900.0       3.0       2.00         1410       Kent
..        ...       ...        ...          ...        ...
101  570000.0       3.0       2.25         2010    Redmond
308  245000.0       3.0       1.50         1260    Seattle
425  260000.0       3.0       2.50         1420       Kent
269  599000.0       3.0       1.75         1960    Seattle
197  599000.0       4.0       2.25         2260   Bellevue

[275 rows x 5 columns]

# Aritmética y alineación de datos

Pandas simplifica las operaciones entre objetos con índices diferentes, alineando las operaciones según la etiqueta del índice. 

Si se trata de un DataFrame, alinea por nombre de columna y etiqueta de fila. 

Veamos un ejemplo:

In [17]:
s1 = pandas.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [18]:
s2 = pandas.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c", "e", "f", "g"])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [8]:
# La resta se realiza coincidiendo el índice, rellenando el resto de valores con NaN
s1 - s2

a    9.4
c   -6.1
d    NaN
e    3.0
f    NaN
g    NaN
dtype: float64

### Práctica 2
Suma la columna precio de ambos samples. 

Una vez sumado, muestra los valores totales, los valores nulos, los valores no nulos. 

Series.isna() devuelve serie Booleana, con True si es nulo, False en caso contrario.

In [13]:
columna_precio=sample1['price']-sample2['price']
print(columna_precio.isna())

0       True
1       True
2       True
3       True
5      False
       ...
495     True
496    False
497     True
498     True
499     True
Name: price, Length: 394, dtype: bool

De la serie "suma" resultante elimina los nulos (dropan())y vuelve a mostrar.

In [15]:
columna_precio.dropna()

5      0.0
15     0.0
23     0.0
26     0.0
27     0.0
      ...
483    0.0
485    0.0
490    0.0
492    0.0
496    0.0
Name: price, Length: 156, dtype: float64

# Métodos aritméticos y evitar valores NaN

En operaciones aritméticas entre objetos indexados de manera diferente, es posible que desee completar los valores faltantes (nan) con un valor especial, como 0, cuando se encuentra una etiqueta de eje en un objeto pero no en el otro. 

Uusando el método del DataFrame o Serie para realizar la operación aritmética podemos indicar mediante el argumento 'fill_value' que sustituirá los valores NaN para realizar la operación aritmética.

Los métodos que comienzan por r tienen los operandos del reverso.

+ suma: add, radd 
+ resta: sub, rsub 	
+ división: div, rdiv 	
+ división entera: floordiv, rfloordiv 	
+ multiplicación: mul, rmul 	
+ exponente: pow, rpow

In [8]:
# Restamos a la Serie s1 los valores de s2 (s1 - s2)
s1.sub(s2, fill_value=0)

a    9.4
c   -6.1
d    3.4
e    3.0
f   -4.0
g   -3.1
dtype: float64

In [13]:
# Con rsub hacemos lo contrario, s2 - s1
s1.rsub(s2, fill_value=0)

a   -9.4
c    6.1
d   -3.4
e   -3.0
f    4.0
g    3.1
dtype: float64

### Práctica 3
Haz lo mismo que en práctica 2, utilizando el método suma y rellenando con 0 los valores faltantes.

In [20]:
sample1['price'].add(sample2['price'],fill_value=0)

0       313000.0
1      2384000.0
2       342000.0
3       420000.0
5       980000.0
         ...
495     950000.0
496     370000.0
497     335000.0
498     210000.0
499     522000.0
Name: price, Length: 394, dtype: float64

### Práctica 4
Copia el df corte500 y crea una nueva columna en la copia que sume la columna precio con la columna precio del dataframe sample1. 

A continuación, muestra las líneas que tienen en esa nueva columna los valores a NaN.

In [33]:
copia_corte500=corte500.reindex(columns=['price','price_sample1','price_combined'],copy=True,fill_value=0)
copia_corte500['price_sample1']=sample1['price']
copia_corte500['price_combined']=sample1['price']+corte500['price']

copia_corte500[pandas.isna(copia_corte500['price_combined'])]

         price  price_sample1  price_combined
1    2384000.0            NaN             NaN
4     550000.0            NaN             NaN
6     335000.0            NaN             NaN
7     482000.0            NaN             NaN
8     452500.0            NaN             NaN
..         ...            ...             ...
486   750000.0            NaN             NaN
488  1315000.0            NaN             NaN
489   372500.0            NaN             NaN
491   360000.0            NaN             NaN
497   335000.0            NaN             NaN

[225 rows x 3 columns]

# ufuncs de Numpy
Las funciones de NumPy ufuncs (los métodos que se aplicaban elemento a elemento del array, como calcular el valor absoluto de cada uno (np.abs()) también funcionan en Pandas. Se puede aplicar a una SEries o a todo un DataFrame

In [ ]:
df = pd.DataFrame(np.random.standard_normal((4, 3)), columns=list("bde"), index=["Utah", "Ohio", "Texas", "Oregon"])
df.head()

               b         d         e
Utah    0.803077  1.254677 -1.343964
Ohio    0.180582  0.956836 -0.147983
Texas  -0.782658 -0.808841 -0.220648
Oregon  0.088158 -0.658032 -0.524030

In [15]:
# Devuelve un DataFrame con los valores modificados
np.abs(df)

               b         d         e
Utah    0.803077  1.254677  1.343964
Ohio    0.180582  0.956836  0.147983
Texas   0.782658  0.808841  0.220648
Oregon  0.088158  0.658032  0.524030

# Práctica 5

Aplia la raíz cuadrada a la columna precio de sample1 con una función de numpy.

In [34]:
numpy.sqrt(sample1['price'])

109    469.041576
444    922.496612
210    809.629545
90     894.911169
467    514.781507
          ...
430    763.544367
335    515.751878
23     782.623792
423    680.441033
57     886.002257
Name: price, Length: 275, dtype: float64

# Apply de Pandas
El método apply sirve para aplicar cualquier función definida por el programador a cada elemento de la Series, devolviendo una nueva Series con el resultado. 

También se puede aplicar a todo un DataFrame por filas o por columnas (devuelve un objeto Series). Por defecto se aplica la función a cada columna.

In [16]:
df.head()

               b         d         e
Utah    0.803077  1.254677 -1.343964
Ohio    0.180582  0.956836 -0.147983
Texas  -0.782658 -0.808841 -0.220648
Oregon  0.088158 -0.658032 -0.524030

In [ ]:
# Tenemos una función que recibe una Serie y devuelve el valor máximo.
def funcion1(x):
    return x.max()

# Aplicamos la función al DataFrame (por defecto axis=0). Obteniendo el máximo de cada columna. 
df.apply(funcion1)

b    0.803077
d    1.254677
e   -0.147983
dtype: float64

In [20]:
# Busca en el eje horizontal, sacando el máximo de cada fila
df.apply(funcion1, axis='columns')

Utah      1.254677
Ohio      0.956836
Texas    -0.220648
Oregon    0.088158
dtype: float64

# Práctica 6

Crea una función que se aplique a los valores de badroom de sample1 un redondeo el valor al entero más cercano

In [37]:
def truncar(x):
    return numpy.trunc(x)

sample1['bedrooms'].apply(truncar)

109    4.0
444    3.0
210    4.0
90     5.0
467    4.0
      ...
430    4.0
335    3.0
23     4.0
423    2.0
57     5.0
Name: bedrooms, Length: 275, dtype: float64

La función a aplicar con apply también puede recibir parámetros

Busca en la documentación de Pandas.

Crea una función similar a la anterior, pero que si el número de baños es mayor a 4 devuelva el entero pasado por parámetro.

In [38]:
def truncar(x):
    return x if x>4 else numpy.trunc(x)
        
sample1['bedrooms'].apply(truncar)

109    4.0
444    3.0
210    4.0
90     5.0
467    4.0
      ...
430    4.0
335    3.0
23     4.0
423    2.0
57     5.0
Name: bedrooms, Length: 275, dtype: float64

# Ordenación por etiquetas del índice
Podemos ordenar por las etiqueas de las filas o columnas utilizando el método sort_index, que retorna un nuevo objeto ordenado. Por defecto ordena en orden ascendente. 

frame.sort_index(axis="columns", ascending=False)

Podemos ordenar por filas -> 'rows'.

In [23]:
df.sort_index(axis="columns", ascending=False)

               e         d         b
Utah   -1.343964  1.254677  0.803077
Ohio   -0.147983  0.956836  0.180582
Texas  -0.220648 -0.808841 -0.782658
Oregon -0.524030 -0.658032  0.088158

# Práctica
Ordena sample 1 por su etiqueta fila

In [41]:
sample1.sort_index(axis="rows", ascending=False)

        price  bedrooms  bathrooms  sqft_living         city
499  522000.0       4.0       2.25         1800     Kirkland
498  210000.0       3.0       2.50         1040      Seattle
496  185000.0       3.0       1.50         1370       Auburn
495  950000.0       5.0       3.00         4530  Woodinville
494  647000.0       4.0       2.50         3040    Sammamish
..        ...       ...        ...          ...          ...
13   365000.0       3.0       1.00         1090      Seattle
5    490000.0       2.0       1.00          880      Seattle
3    420000.0       3.0       2.25         2000     Bellevue
2    342000.0       3.0       2.00         1930         Kent
0    313000.0       3.0       1.50         1340    Shoreline

[275 rows x 5 columns]

# Ordenación por valores

Al ordenar un DataFrame por valores de una columna, podemos especificar por cuál columna ordenar. También podemos indicar una lista de columnas. 

+ df.sort_values('columna')
+ df.sort_values(['col1', 'col2'])

# Práctica

Ordena sample1 número de habitaciones en primer lugar y después por precio.

In [42]:
sample1.sort_values(['bedrooms','price'])

         price  bedrooms  bathrooms  sqft_living              city
477   235000.0       1.0       1.00          810           Seattle
290   100000.0       2.0       1.00          910            Algona
298   160000.0       2.0       1.00         1040              Kent
405   195000.0       2.0       1.00          720           Seattle
117   206000.0       2.0       1.00          810            Burien
..         ...       ...        ...          ...               ...
356  1750000.0       6.0       3.00         3510           Seattle
291   540000.0       7.0       5.75         3700  Lake Forest Park
122  2280000.0       7.0       8.00        13540           Redmond
252  3200000.0       7.0       4.50         6210           Seattle
241   599999.0       9.0       4.50         3830           Seattle

[275 rows x 5 columns]

# Práctica
Genera una serie con el precio medio de cada ciudad. Si necesitas bucles puedes usarlos.

In [62]:
# precios_media=sample1.groupby('city')['price'].mean()
# precios_media

diccionario={}
for city in sample1['city'].unique():
    media_precio = sample1[sample1['city'] == city]['price'].mean()
    diccionario[city] = round(media_precio,2)
precios_media=pandas.Series(diccionario)

precios_media

Federal Way          337859.09
Redmond              720290.50
Shoreline            381618.75
Kirkland             584930.07
Kent                 293376.92
Renton               417978.12
Seattle              563451.49
Tukwila              229000.00
Mercer Island        895550.00
Bellevue             705767.94
Maple Valley         310430.00
Fall City            305000.00
Sammamish            988371.43
Ravensdale           415000.00
Issaquah             650445.38
Covington            236333.33
Auburn               308595.00
Burien               394416.67
Des Moines           240633.33
Kenmore              503225.00
Woodinville          670687.50
Algona               192666.67
Lake Forest Park     552500.00
North Bend           277500.00
Carnation            403500.00
Snoqualmie           645000.00
Black Diamond        234950.00
Duvall               351500.00
Clyde Hill          1110000.00
Bothell              612500.00
dtype: float64


# Práctica

Genera un df a partir de sample1 con las casas más baratas que la media en función de la ciudad en la que se encuentran.

In [ ]:
media_precio_ciudad = sample1.groupby('city')['price'].mean().reset_index()
media_precio_ciudad.columns = ['city', 'mean_price']

sample1_con_media = sample1.merge(media_precio_ciudad, on='city')

casas_mas_baratas = sample1_con_media[sample1_con_media['price'] < sample1_con_media['mean_price']]
casas_mas_baratas

        price  bedrooms  bathrooms  sqft_living         city     mean_price
0    220000.0       4.0       1.50         1240  Federal Way  337859.090909
4    265000.0       4.0       1.00         1940         Kent  293376.923077
5    349000.0       3.0       1.75         1590       Renton  417978.125000
8    352000.0       5.0       2.50         2420      Seattle  563451.489362
10   295000.0       3.0       2.50         1920  Federal Way  337859.090909
..        ...       ...        ...          ...          ...            ...
265  525888.0       5.0       1.75         2550     Issaquah  650445.375000
269  353000.0       3.0       1.00         1350      Seattle  563451.489362
270  583000.0       4.0       2.50         2660      Redmond  720290.500000
271  266000.0       3.0       2.50         1940         Kent  293376.923077
273  463000.0       2.0       1.00         1150      Seattle  563451.489362

[171 rows x 6 columns]

# MultiIndex

__set_index__ nos permite indicar qué columna serán las etiquetas de las filas (índice de filas). Pero también podemos indicar más de una columna, obteniendo indices de varios niveles.

Si seleccionamos una columna que no es única en sus valores debemos tenerlo en cuenta, ya que tendremos un índice no único como filas.

In [24]:
# Ejemplo
import pandas as pd

data = {
    'Ciudad': ['Madrid', 'Madrid', 'Barcelona', 'Barcelona'],
    'Año': [2023, 2024, 2023, 2024],
    'Ventas': [100, 120, 90, 110],
    'Gastos': [70, 80, 60, 75]
}
df = pd.DataFrame(data)
df.head()

      Ciudad   Año  Ventas  Gastos
0     Madrid  2023     100      70
1     Madrid  2024     120      80
2  Barcelona  2023      90      60
3  Barcelona  2024     110      75

In [26]:
# Agrupamos datos primero por Ciudad y luego por Año
df_multi = df.set_index(['Ciudad', 'Año'])
df_multi.head()

                Ventas  Gastos
Ciudad    Año
Madrid    2023     100      70
          2024     120      80
Barcelona 2023      90      60
          2024     110      75

In [28]:
# Indexación en orden de jerarquía
# Todos los datos de madrid 
df_multi.loc['Madrid']

      Ventas  Gastos
Año
2023     100      70
2024     120      80

In [29]:
# Indexación de filas concretas usando una tupla de índices
# Madrid 2023  
df_multi.loc[('Madrid', 2023)]

Ventas    100
Gastos     70
Name: (Madrid, 2023), dtype: int64

# Práctica

Carga house de nuevo en un df. Pon la columna City como índices de primer nivel y bedrooms como segundo nivel. Ordena los datos por estos índices.

In [70]:
# Idexa por las columnas indicadas y ordena
import pandas
import numpy

df_casas = pandas.read_csv('house.csv')

In [71]:
# Muestra los datos de la ciudad Auburn
df_casas_multi=df_casas.set_index(['city','bedrooms'])
df_casas_multi.head()

,,date,price,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,statezip,country
city,bedrooms,,,,,,,,,,,,,,,,
Shoreline,3.0,2014-05-02 00:00:00,313000.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,WA 98133,USA
Seattle,5.0,2014-05-02 00:00:00,2384000.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,WA 98119,USA
Kent,3.0,2014-05-02 00:00:00,342000.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,WA 98042,USA
Bellevue,3.0,2014-05-02 00:00:00,420000.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,WA 98008,USA
Redmond,4.0,2014-05-02 00:00:00,550000.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,WA 98052,USA

In [72]:
# Muestra los datos de Auburn con 6 habitaciones
df_casas_multi.loc[('Auburn', 6)]

/tmp/ipykernel_9201/1648425202.py:2: PerformanceWarning: indexing past lexsort depth may impact performance.
  df_casas_multi.loc[('Auburn', 6)]

                                date     price  bathrooms  sqft_living  \
city   bedrooms
Auburn 6.0       2014-05-20 00:00:00  300000.0       5.25         2860
       6.0       2014-05-21 00:00:00  260000.0       2.00         2220

                 sqft_lot  floors  waterfront  view  condition  sqft_above  \
city   bedrooms
Auburn 6.0           5682     2.0           0     0          3        2860
       6.0           8797     1.0           0     0          3        2220

                 sqft_basement  yr_built  yr_renovated          street  \
city   bedrooms
Auburn 6.0                   0      1978             0   606 5th St SE
       6.0                   0      1977          2004  142 11th St SE

                 statezip country
city   bedrooms
Auburn 6.0       WA 98002     USA
       6.0       WA 98002     USA